import random
lst=["剪刀","石头","布"]
dic1={('石头', '布'):"布赢",('石头', '石头'):"平局",('石头', '剪刀'):"石头赢",
      ('剪刀', '布'):"剪刀赢",('剪刀', '剪刀'):"平局",('剪刀', '石头'):"石头赢",
      ('布', '石头'):"布赢",('布', '布'):"平局",('布', '剪刀'):"剪刀赢"}
res=[]
for i in range(100):
    x=random.randint(0,2)
    y=random.randint(0,2)
    temp=(lst[x],lst[y],dic1[(lst[x],lst[y])])

    res.append(temp)

print(res)

#输出：
[('布', '剪刀', '剪刀赢'), ('石头', '石头', '平局'), ('布', '石头', '布赢'),
 ('石头', '布', '布赢'), ('石头', '剪刀', '石头赢'), ('石头', '布', '布赢'),
 ('布', '剪刀', '剪刀赢'), ('剪刀', '布', '剪刀赢'), ('石头', '布', '布赢'),
 ('布', '剪刀', '剪刀赢'), ('布', '剪刀', '剪刀赢'), ('石头', '布', '布赢'),
 ('石头', '石头', '平局'), ('石头', '剪刀', '石头赢'), ('石头', '剪刀', '石头赢'),
 ('布', '石头', '布赢'), ('石头', '石头', '平局'), ('剪刀', '布', '剪刀赢'),
 ('剪刀', '剪刀', '平局'), ('石头', '石头', '平局'), ('剪刀', '布', '剪刀赢'),
 ('布', '石头', '布赢'), ('剪刀', '石头', '石头赢'), ('剪刀', '剪刀', '平局'),
 ('剪刀', '布', '剪刀赢'), ('布', '石头', '布赢'), ('石头', '石头', '平局'),
 ('剪刀', '布', '剪刀赢'), ('布', '剪刀', '剪刀赢'), ('剪刀', '剪刀', '平局'),
 ('石头', '布', '布赢'), ('石头', '布', '布赢'), ('布', '石头', '布赢'),
 ('剪刀', '石头', '石头赢'), ('石头', '布', '布赢'), ('石头', '石头', '平局'),
 ('剪刀', '布', '剪刀赢'), ('剪刀', '布', '剪刀赢'), ('布', '布', '平局'),
 ('布', '剪刀', '剪刀赢'), ('布', '剪刀', '剪刀赢'), ('石头', '布', '布赢'),
 ('布', '剪刀', '剪刀赢'), ('石头', '石头', '平局'), ('剪刀', '剪刀', '平局'),
 ('剪刀', '剪刀', '平局'), ('剪刀', '剪刀', '平局'), ('布', '剪刀', '剪刀赢'),
 ('剪刀', '石头', '石头赢'), ('剪刀', '石头', '石头赢'), ('石头', '剪刀', '石头赢'),
 ('剪刀', '布', '剪刀赢'), ('剪刀', '剪刀', '平局'), ('石头', '石头', '平局'),
 ('剪刀', '剪刀', '平局'), ('布', '布', '平局'), ('石头', '石头', '平局'),
 ('石头', '布', '布赢'), ('布', '剪刀', '剪刀赢'), ('布', '石头', '布赢'),
 ('剪刀', '石头', '石头赢'), ('剪刀', '剪刀', '平局'), ('剪刀', '布', '剪刀赢'),
 ('剪刀', '布', '剪刀赢'), ('剪刀', '布', '剪刀赢'), ('布', '剪刀', '剪刀赢'),
 ('布', '剪刀', '剪刀赢'), ('剪刀', '剪刀', '平局'), ('石头', '布', '布赢'),
 ('剪刀', '剪刀', '平局'), ('剪刀', '剪刀', '平局'), ('布', '布', '平局'),
 ('布', '剪刀', '剪刀赢'), ('剪刀', '石头', '石头赢'), ('布', '布', '平局'),
 ('石头', '布', '布赢'), ('剪刀', '石头', '石头赢'), ('石头', '剪刀', '石头赢'),
 ('石头', '石头', '平局'), ('剪刀', '布', '剪刀赢'), ('剪刀', '剪刀', '平局'),
 ('布', '布', '平局'), ('剪刀', '石头', '石头赢'), ('剪刀', '石头', '石头赢'),
 ('石头', '剪刀', '石头赢'), ('布', '剪刀', '剪刀赢'), ('布', '石头', '布赢'),
 ('剪刀', '石头', '石头赢'), ('石头', '布', '布赢'), ('剪刀', '布', '剪刀赢'),
 ('布', '剪刀', '剪刀赢'), ('石头', '布', '布赢'), ('石头', '石头', '平局'),
 ('石头', '布', '布赢'), ('剪刀', '剪刀', '平局'), ('剪刀', '石头', '石头赢'),
 ('石头', '剪刀', '石头赢'), ('石头', '布', '布赢'), ('石头', '剪刀', '石头赢'),
 ('石头', '石头', '平局')]


